import {ScienceCategory} from "../shared/interfaces/science.interface";

export const mockScienceCycle: ScienceCategory = {
  title: "",
  aboutCycle1: "<p>Ритуальні зимові обходи дворів зі спеціальними піснями тривають від Різдва до Водохреща. Мета обходів – побажати господарям добробуту і здоров’я на весь майбутній рік. За давніми (дохристиянськими) уявленнями учасники обходів виконують волю предків – опікунів роду.</p><p>У більшості традицій на Різдво колядують (колядування могло тривати до Водохреща), ставлять Вертеп; напередодні Нового Року – щедрують (в зоні Карпат, в Галичині щедрування відсутні), водять Козу, Меланку, Коня тощо. На Новий рік посівають.</p>",
  aboutCycle2: "<p>Діти і молодь (хлопці, дівчата) колядують/щедрують попід хатою (під вікном або під дверима), зрідка могли заходити в сіни. Дорослих (одружених чоловіків і жінок), співаків церковної півчої – які співали колядки переважно християнської тематики – запрошують до хати. Ряджену «Козу» заводять до хати.</p> <p>Раніше господарі обдаровували колядників/щедрівників наїдками (ритуальне годування задобрення духів предків): пампушками, млинцями, коржиками, горіхами, насінням; пізніше – солодощами; у наш час – грошима.</p>",
  subcategories: [
    {
      title: "Ранньотрадиційний репертуар",
      urlImg: "",
      links: ["Дитячі колядки та щедрівки", "Величальні колядки та щедрівки дорослого репертуару", "Пісні до новорічних карнавальних процесій Коза і Меланка", "Засівання"]
    },
    {
      title: "Пізній (християнський) зимовий репертуар",
      links: ["Колядки пізнього походження", "Різдвяні канти (церковні колядки)", "Вертеп", "Пародійні колядки"]
    }
  ]
}
